package main

var reverseCharGlyphs = map[string]rune{
	"║╝": 'a',
	"╚╗": 'b',
	"╔╝": 'c',
	"╔╗": 'd',
	"║╗": 'e',
	"╔═": 'f',
	"═╗": 'g',
	"╚╝": 'h',
	"║║": 'i',
	"═╝": 'j',
	"══": 'k',
	"╚═": 'l',
	"╗╝": 'm',
	"╝╝": 'n',
	"╔║": 'o',
	"╝╔": 'p',
	"╝╗": 'q',
	"╚╚": 'r',
	"═╚": 's',
	"╔╔": 't',
	"╚║": 'u',
	"═╔": 'v',
	"╗╗": 'w',
	"╗═": 'x',
	"═║": 'y',
	"╗╚": 'z',
}

var reverseNumberGlyphs = map[string]rune{
	"(ƞ": '1',
	"@#": '2',
	"Ʃ^": '3',
	"*¢": '4',
	"(Ʈ": '5',
	"+Ĳ": '6',
	"ƴƴ": '7',
	"_Ɨ": '8',
	"Ɩ)": '9',
	"Ɖ)": '0',
}

var reverseSpecialGlyphs = map[string]rune{
	"Ͳ": '.',
	"Ȝ": ',',
	">": '"',
	"Ϟ": '-',
	"$": ';',
	"ī": ':',
}
